app/controllers/quotes_controller.rb

SELECT * FROM "quotes"
---
  def index
		@quotes = Quote.all

SELECT * FROM "quotes" WHERE ("quotes"."id" = 1)
---
  def view
    @quote = Quote.find(params[:id])

SELECT * FROM "quotes" WHERE ("quotes"."id" = 1)
---
	def show
		@quote = Quote.find(params[:id])

SELECT * FROM "quotes" WHERE ("quotes"."id" = 1)
---
	def edit
		@quote = Quote.find(params[:id])

INSERT INTO "authors" ("name", "updated_at", "created_at") VALUES('test', '2009-05-30 16:46:21', '2009-05-30 16:46:21')
INSERT INTO "quotes" ("updated_at", "text", "author_id", "created_at") VALUES('2009-05-30 16:45:40', 'whoazah', NULL, '2009-05-30 16:45:40')
SELECT * FROM "authors" WHERE ("authors"."name" = 'Joe') LIMIT 1
SELECT * FROM "quotes" WHERE ("quotes".author_id = 2)
---
  def create
		puts "-------"
		p params
		p params[:quote][:author]
		p params[:quote][:author][:name]
		puts "-------"

		# Create the author if it doesn't exist
		params[:quote][:author] = Author.find_or_create_by_name( params[:quote][:author][:name] )