app/controllers/quotes_controller.rb

	def update
		@quote = Quote.find( params[:id] )
---
SELECT * FROM "quotes" WHERE ("quotes"."id" = 1)

	def destroy
		@quote = Quote.find( params[:id] )
		@quote.destroy
---
SELECT * FROM "quotes" WHERE ("quotes"."id" = 9)
DELETE FROM "quotes" WHERE "id" = 9